ASK_REENTER = "Пожалуйста, используйте доступные пункты меню."

MAIN_WELCOME = "Вы в главном меню. Выберите действие"

INFO_WELCOME = "Вы в меню информации. Выберите действие"

HOWTO_MESS = 'В статье ниже мы подробно с картинками объясняем как правильно ' \
             'пользоваться чат-ботом и какие у него есть возможности:\n' \
             'https://telegra.ph/Kak-polzovatsya-botom-06-19\n' \
             'Если у вас остались вопросы, задайте нам их через форму «Задать вопрос» ' \
             'и мы постараемся максимально быстро на него ответить.'


QA_MESS = 'Ответы на часто задаваемые вопросы вы можете найти по ссылке ниже: https://telegra.ph/FAQ-01-23-5 \n' \
          'Если у вас есть предложения по расширению FAQ – смело присылайте их нам через форму «Предложить идею» в нашем боте.'

DIGESTS_MESS = 'Со списком изменений в новой версии ПО вы можете ознакомиться в наших дайджестах, ' \
               'доступных по ссылке: https://disk.yandex.ru/d/m8cN0B30ILcAgw'


CHANGE_USER_INFO_MESS = "Сообщите, какие данные вы хотите изменить"

TO_ADMIN_USER_CHANGE_INFO = "Запрос об изменении данных пользователя #{} \nПользователь:\n"
TO_ADMIN_NEW_PROBLEM = "Новая проблема #{} \nПользователь:\n"
TO_ADMIN_NEW_IDEA = "Новая идея #{} \nПользователь:\n"
TO_ADMIN_NEW_QUESTION = "Новый вопрос #{} \nПользователь:\n"

TO_ADMIN_NEW = {"problems":TO_ADMIN_NEW_PROBLEM,
                "ideas":TO_ADMIN_NEW_IDEA,
                "questions":TO_ADMIN_NEW_QUESTION}

MESSAGE_SENDING = "Ожидайте отправки сообщения. Это займет некоторое время"

USER_IFO_REQUEST_SEND = 'Заявка на изменение ваших персональных данных направлена команде Wink. ' \
                        'В ближайшее время с вами свяжутся наши менеджеры для корректировки информации.'

MESSAGE_SENDED = "Сообщение было направлено команде Wink."

CHECK_MESS = 'Чек-лист для прохождения тестирования доступен по ссылке: ' \
             'https://forms.yandex.ru/cloud/628ccdfae0d9ea5a4b477249/'


ASK_PROBLEM1 = 'Подробно опишите проблему/ошибку, с которой вы столкнулись и пошагово распишите свои действия. ' \
               'Уточните, воспроизводится ли эта проблема/ошибка повторно или нет. При необходимости приложите фото или видео.'

ASK_PROBLEM2 = '<b>Инструкция:</b> \n' \
               '1. Отправьте в чат бота текстовое описание проблемы. \n' \
               '2. При необходимости загрузите фото или видео. \n' \
               '3. После того как текстовое описание проблемы отправлено и медиафайлы загрузились, нажмите кнопку <b>«Отправить проблему»</b> \n' \
               'При необходимости, команда Wink свяжется с вами для уточнения деталей.'
            

ASK_IDEA1 = 'Подробно опишите в чем заключается ваша идея и какую ценность она принесет сервису и пользователям Wink.'

ASK_IDEA2 = '<b>Инструкция:</b> \n' \
           '1. Отправьте в чат бота текстовое описание вашей идеи.\n' \
           '2. При необходимости загрузите фото или видео.\n' \
           '3. После того как текстовое описание идеи отправлено и медиафайлы загрузились, нажмите кнопку <b>«Отправить идею»</b>\n' \
           'При необходимости, команда Wink свяжется с вами для уточнения деталей.'

ASK_QUESTION1 = 'Подробно опишите свой вопрос. Чем больше деталей будет в вашем вопросе, тем более точно мы сможем на него ответить.' 

ASK_QUESTION2 = '<b>Инструкция:</b> \n' \
               '1. Отправьте в чат бота ваш вопрос.\n' \
               '2. При необходимости загрузите фото или видео.\n' \
               '3. После того как текст и медиафайлы загрузились, нажмите кнопку <b>«Отправить вопрос»</b>\n' \
               'Команда Wink постарается максимально оперативно ответить на ваш вопрос.'

BIG_FILE = "Файл больше 20 Мб. Загрузите его самостоятельно в облако, а здесь укажите ссылку"

EMPTY_MESSAGE = "Вы пытаетесь отправить пустое обращение. Введите текст или прикрепите медиафайлы и нажмите кнопку «Отправить...»?"