ASK_REENTER = "Пожалуйста, выберите ответ, используя клавиатуру."

MAIN_WELCOME = "Вы в главном меню. Выберите действие"

INFO_WELCOME = "Вы в меню информации. Выберите действие"

HOWTO_MESS = "Заглушка HOWTO_MESS"

QA_MESS = "Заглушка QA_MESS"

DIGESTS_MESS = "Заглушка DIGESTS_MESS"

CHANGE_USER_INFO_MESS = "Сообщите, какие данные вы хотите изменить"

TO_ADMIN_USER_CHANGE_INFO = "Запрос о изменении данных пользователя\nИД сообщения {} \nПользователь\n"
TO_ADMIN_NEW_PROBLEM = "Информация о новой проблеме\nИД сообщения {} \nПользователь\n"
TO_ADMIN_NEW_IDEA = "Информация о новой идее\nИД сообщения {} \nПользователь\n"
TO_ADMIN_NEW_QUESTION = "Новый вопрос\nИД сообщения {} \nПользователь\n"

TO_ADMIN_NEW = {"problems":TO_ADMIN_NEW_PROBLEM,
                "ideas":TO_ADMIN_NEW_IDEA,
                "questions":TO_ADMIN_NEW_QUESTION}

MESSAGE_SENDING = "Ожидайте отправки сообщения. Это займет некоторое время"

USER_IFO_REQUEST_SEND = 'Заявка на изменение ваших персональных данных направлена команде Wink. ' \
                        'В ближайшее время с вами свяжутся наши менеджеры для корректировки информации.'

MESSAGE_SENDED = "Сообщение было направлено команде Wink."

CHECK_MESS = "Заглушка CHECK_MESS"

ASK_PROBLEM = 'Подробно опишите проблему/ошибку, с которой вы столкнулись и пошагово распишите свои действия.' \
              'Уточните, воспроизводится ли эта проблема/ошибка повторно или нет. При необходимости приложите фото или видео. ' \
              'Рекомендуем предварительно ознакомиться с информацией о том, как правильно сообщать ' \
              'о найденных проблемах/ошибках в разделе «Полезная информация – Как пользоваться ботом». ' \
              'При необходимости, команда Wink свяжется с вами для уточнения деталей. ' \
              'Не нажимайте "Отправить" до того как файлы полностью загрузятся'

ASK_IDEA = 'Подробно опишите в чем заключается ваша идея и какую ценность ' \
           'она принесет сервису и пользователям Wink. ' \
           'При необходимости, команда Wink свяжется с вами для уточнения деталей. ' \
           'Не нажимайте "Отправить" до того как файлы полностью загрузятся'

ASK_QUESTION = 'Подробно опишите свой вопрос. Чем больше деталей будет в вашем вопросе, ' \
               'тем более точно мы сможем на него ответить. Команда Wink постарается максимально ' \
               'оперативно ответить на ваш вопрос. ' \
               'Не нажимайте "Отправить" до того как файлы полностью загрузятся'

BIG_FILE = "Файл больше 20 Мб. Загрузите его самостоятельно в облако, а здесь укажите ссылку"