ASK_REENTER = "Пожалуйста, выберите ответ, используя клавиатуру."

MAIN_WELCOME = "Вы в главном меню. Выберите действие"

INFO_WELCOME = "Вы в меню информации. Выберите действие"

HOWTO_MESS = "Заглушка HOWTO_MESS"

QA_MESS = "Заглушка QA_MESS"

DIGESTS_MESS = "Заглушка DIGESTS_MESS"

CHANGE_USER_INFO_MESS = "Сообщите, какие данные вы хотите изменить"

TO_ADMIN_USER_CHANGE_INFO = "Запрос о изменении данных пользователя\nИД сообщения {} \nПользователь\n"
TO_ADMIN_NEW_PROBLEM = "Информация о новой проблеме\nИД сообщения {} \nПользователь\n"
TO_ADMIN_NEW_IDEA = "Информация о новой идее\nИД сообщения {} \nПользователь\n"
TO_ADMIN_NEW_QUESTION = "Новый вопрос\nИД сообщения {} \nПользователь\n"

TO_ADMIN_NEW = {"problems":TO_ADMIN_NEW_PROBLEM,
                "ideas":TO_ADMIN_NEW_IDEA,
                "questions":TO_ADMIN_NEW_QUESTION}

MESSAGE_SENDING = "Ожидайте отправки сообщения. Это займет некоторое время"

MESSAGE_SENDED = "Сообщение было отправлено администраторам"

CHECK_MESS = "Заглушка CHECK_MESS"

ASK_PROBLEM = 'Сообщите о проблеме. Отправьте текст приложите файлы и нажмите "Отправить"' \
              'Не нажимайте "Отправить" до того как файлы полностью загрузятся'

ASK_IDEA = 'Сообщите о идее. Отправьте текст приложите файлы и нажмите "Отправить"' \
           'Не нажимайте "Отправить" до того как файлы полностью загрузятся'

ASK_QUESTION = 'Задайте вопрос. Отправьте текст приложите файлы и нажмите "Отправить"' \
               'Не нажимайте "Отправить" до того как файлы полностью загрузятся'

BIG_FILE = "Файл больше 20 Мб. Загрузите его самостоятельно в облако, а здесь укажите ссылку"