EMPTY = []
CANCEL = ["Прервать регистрацию"]
OK = ["OK"]
APPROVAL_ANSWERS = ["Согласен", "Не согласен"] # Текст менять можно, смысл и количество нельзя
YES_NO = ["Да", "Нет"]
TV_BOXES = [
            "SML-5050",
            "SML-482",
            "SML-292",
            "SML-282",
            "Switron-1500",
            "B700V7L",
            "PS7105",
            "Z123",
            "IP_STB_HD",
            "Mag250",
            "Yuxing-YX6916A",
            "Motorola_VIP1963",
            "Motorola_VIP1003",
            "Qbox",
            "STB122A",
            "B866V2",
            "IP6003",
            "Другое"   # Этот пункт должен быть последним, при его выборе регистрация отмениться
            ]

MRF = [
        "MOS",
        "CT",
        "NW",
        "SOUTH",
        "VLG",
        "SIB",
        "URAL",
        "DV",
        "Прервать" # Этот пункт должен быть последним, при его выборе регистрация отмениться
      ]
