REGISTRATION_CANCELED = "Процедура регистраци отменена." 

ASK_REENTER = "Пожалуйста, выберите ответ, используя клавиатуру."  

USERNAME_NEEDED = "<b>Рекомендуется создать имя пользователя в настройках своего профиля Telegram. И затем сообщить его нам</b>"
                  
WELCOME = "Добрый день! Вы находитесь в Telegram боте проекта по бета-тестированию видеосервиса Wink на ТВ-приставках. " \
          "Для участия вам необходимо пройти регистрацию. Ознакомьтесь, пожалуйста, с Политикой конфиденциальности. " \
          "Нажимая кнопку «Согласен» вы даете свое согласие на обработку ваших персональных данных. " \
          "Это необходимо, чтобы мы (команда Wink) могли с вами взаимодействовать. " \
          "Политика конфиденциальности: https://www.rt.ru/legal" 

ASK_PHONE = "Для предоставления нам вашего номера нажмите 'Отправить телефонный номер'"          

ASK_FIO = "Укажите ваше ФИО. Можете указывать не полностью, достаточно будет Имени и Фамилии. Пример: Александр Иванов"

ASK_EMAIL = "Укажите ваш E-mail в формате <b>example@domain.ru</b>. " \
            "E-mail необходим для рассылки новостей, важных изменений, наград за участие и т.д."
           

BAD_EMAIL = "E-mail введен неверно. Пожалуйста повторите ввод"

ASK_TV = "У вас есть ТВ-приставка с интерфейсом Wink?"

ANSW_NOBOX = "К сожалению, тестирование доступно только для абонентов, которые имеют ТВ-приставку, " \
             "т.к. другие платформы (Web, Smart TV, Mobile) пока не участвуют в данном проекте." 

ASK_MODEL = "Укажите модель вашей ТВ-приставки. Перейдите в раздел Моё – Настройки – " \
            "Информация о системе – Система. В поле «Модель приставки» будет указана ваш модель."           

ANSW_BADMODEL = "К сожалению, тестирование доступно только для абонентов, которые имеют ТВ-приставку " \
                "перечисленных моделей, т.к. другие модели пока не участвуют в данном проекте." 


ASK_MRF = "Укажите ваш <b>Домашний МРФ</b>. Перейдите в раздел Моё – Настройки – Информация " \
          "о системе – Аккаунт. В поле «Домашний МРФ» будет указан ваш МРФ."

ASK_SAN = "Укажите ваш <b>Номер пользователя</b>. Перейдите в раздел Моё – Настройки – Информация о системе – " \
                 "Аккаунт. В поле «Номер пользователя» будет указан номер."
                 
BAD_SAN = "Номер пользователя должен состоять только из цифр."

ASK_MAK = "Укажите ваш <b>МАС адрес</b> в виде 00:29:15:80:4E:4A. Перейдите в раздел Моё – Настройки – " \
          "Информация о системе – Система. В поле «STB ID» будет указан ваш MAC адрес."
                         
BAD_MAK = "Вы ввели некорректное значение MAC адреса. Проверьте введенные вами буквы и цифры и повторите ввод. " \
          "Обратите внимание, что в МАС адресе используется только латинские (английские) буквы от «А» до «F» и цифры от «0» до «9»."

FIN_MESS = "Поздравляем! Вы успешно зарегистрировались в системе бета-тестирования Wink. " \
           "Ваш персональный ID <b>{}</b>. Данный номер потребуется для прохождения заданий, " \
           "опросов и начислений наград. Посмотреть и скорректировать свои данные вы можете в разделе " \
           "«Полезная информация – Мои данные»."
FIN_MESS2 = "Данный бот позволит вам: \n" \
            "- Сообщать о найденных проблемах \n" \
            "- Задать вопрос \n" \
            "- Предложить идею или улучшение \n" \
            "- Узнать больше о возможностях сервиса Wink \n" \
            "- Проходить задания и получать награды \n" \
            "Все новости, опросы и обсуждения проходят в нашем канале @{} \n" \
            "Присоединяйтесь! \n" \
           