REGISTRATION_CANCELED = "Процедура регистраци отменена." 

USERNAME_NEEDED = """
                     Необходимо ввести имя пользователя в настройках Telegram.\n
                     И заново начать регистрацию нажав кнопку /start
                  """
WELCOME = """
             Рады видеть Вас в кандитатах на участие в команде тестирования!\n
             Для продолжения Вам необходимо дать согласие на обработку персональных данных.
          """

ASK_PHONE = """
               Для предоставления нам вашего номера нажмите 'Отправить телефонный номер'
            """          

ASK_REENTER = "Пожалуйста, выберите ответ, используя клавиатуру."  

ASK_FIO = "Пожалуйста, введите Ваши Фамилию Имя Отчество"

ASK_EMAIL = "Пожалуйста, введите Ваш e-mail"

BAD_EMAIL = "E-mail введен неверно. Пожалуйста повторите ввод"

ASK_TV = "У Вас есть ТВ приставка"

